[{"Media":"https://youtu.be/fPBByhhJFbw","Paper ID":"76","Paper Title":"Becoming latency-native","Abstract":"The potential richness of audio technology on the internet springs from advancements integral to developments driven by the primary concerns of commerce and science, giving rise to operable and affordable bandwidth in newly-accessible geographical areas as well as the growing sophistication of codecs, browser technology and audio frameworks. Yet use of these tools remains unexplored for music performance, with the primary cause of disruption to performance flows being transmission latency. Through the employment of sophisticated tools and processes, musicians may, however, learn to navigate Networked Music systems as a native performance platform.","Author Names":"Rebekah Wilson (Source Elements)*","Track Name":"Keynote","Files":"WAC Keynote - Rebekah Wilson - 2019-10-30.pdf (140275 bytes)","Pages":"168--169"},{"Media":"https://youtu.be/9XK6Jp-66rY","Paper ID":"77","Paper Title":"On our Past, Present, and Future with Web Audio Technologies – a participatory keynote address","Abstract":"(1) Since I am infected, I often have a hard time to enjoy concerts. Most of them feel like ancient rituals representing the idea that we are unable to listen to and adequately express ourselves towards each other when we are more than a few. These rituals seem to remind us that if we express ourselves we have to make the others listen and that if ever we are more than a few we have to follow a leader and/or a detailed script. Meaningful relationships are often pictured as requiring elaborated action plans and persevering repetition. I don’t really remember how this relates to my life.(2) Since I am infected, I don’t understand anymore why so many creators spend so much time on producing works which exclude their audience from the relationships they represent. At best, the audience is allowed to observe meticulously elaborated symbolic enactments from afar.(3) However, I appreciate the collective silence before the show, when all participants are united in mutual attention.(4) Like other communication technologies, web technologies extend our possibilities to create, maintain, and control our relationships to others.(5) Music consists in its essence of metaphors for the relationships our lives are made of and for the way we create, maintain, and control them.(6) What I always liked about digital music technologies is the possibility to constantly build new instruments and environments that play with these metaphors to embrace very different practices, people and communities.(7) What I particularly like about web technologies is how they allow for effortlessly creating networks of mutual attention and multilateral interaction that may stand as lively metaphors for open, diverse, and pluralistic societies.","Author Names":"Norbert Schnell (Furtwangen University)*","Track Name":"Keynote","Files":"wac-2019-keynote-schnell.pdf (90522 bytes)","Pages":"170"},{"Media":"https://youtu.be/hO810OoIN4s","Paper ID":"81","Paper Title":"Recent and future evolution of the Web Audio API","Abstract":"There have been 358 commits in 125 pull requests to theWeb Audio API specification repository since the Web Au-dio Conference 2018 in Berlin, with a number of importantchanges.This yearly talk at the Web Audio Conference aims to de-mystify the world of web specifications, as well as informingauthors of the current specification status, new features, bugfixes, and what the group has planned for the future.In consequence, this talk is structured in three parts:• What’s new in the spec since WAC’18?• Where are we in the standardization process?• What’s next?","Author Names":"Paul Adenot (Mozilla)*","Track Name":"Keynote","Files":"abstract.pdf (124442 bytes)","Pages":"171--172"},{"Media":"","Paper ID":"","Paper Title":"","Abstract":"","Author Names":"","Track Name":"","Files":"","Pages":""},{"Media":"","Paper ID":"","Paper Title":"","Abstract":"","Author Names":"","Track Name":"","Files":"","Pages":""},{"Media":"","Paper ID":"","Paper Title":"","Abstract":"","Author Names":"","Track Name":"","Files":"","Pages":""}]