[{"Media":"https://youtu.be/Fj5R0IrgTCU","Paper ID":"15","Paper Title":"Creating a DJ-ready Web Player for Interactive Music","Abstract":"The talk will explore the motivation, challenges and solutions devised in a year-long quest to build a DJ-ready web player for songsling.studio, a tool I’m building for publishing and presenting interactive music on the Internet. The player itself utilizes an HLS-like solution as a streaming mechanism, and allows arbitrary changes to the playback speed, direction and content. I will dive into the history and legacy of computerized music playback systems, the dangers of leaving music presentation in the hands of a few dominant platforms and highlight the unrealized potential of our everyday computing devices.","Author Names":"Attila Haraszti (Haywirez)*","Track Name":"Talk","Files":"Web Audio Conf 2019 Camera Ready Submission - Creating a DJ-ready Web Player for Interactive Music - Attila Haraszti.pdf (150554 bytes)","Pages":"109--110"},{"Media":"https://youtu.be/9iHS0OQ6_zQ","Paper ID":"25","Paper Title":"Building an intuitive web-based musical instrument","Abstract":"In this talk, I will describe the design of Pastelloops, which is a web-based musical instrument and an interface that can be used for composition and live improvisation using intuitive free-hand drawing on a canvas using a mouse or touch-based interaction.","Author Names":"Ashish Dubey (Grofers)*","Track Name":"Talk","Files":"pastelloops_paper_rev2.pdf (393232 bytes)","Pages":"111--112"},{"Media":"https://youtu.be/reQCYHjfkzY","Paper ID":"46","Paper Title":"The new WAC website: towards a sustainable conference","Abstract":"Started in 2015,  WAC is a young conference,  but has also reached  a  maturity  state  with  regular  1-1.5  year  intervals between  editions.   There  is  however  a  lack  of  consistency between the conference proceedings which makes them difficult to index and find.  Also, publications often include associated audiovisual media.  We have created a centralized website with the proceedings indexed consistently combined with other relevant information.  We have also developed a collection of guidelines and designed the website in a format that can be used by the forthcoming conference organizers. In this talk, we will present the new website, the project workflow, and the tools and libraries used for development. We  will  also  reflect  on  the  lessons  learned  and  a  set  of recommendations to keep the conference sustainable.","Author Names":"Jørgen Varpe (Norwegian University of Science and Technology); Eigil Aandahl (NTNU)*","Track Name":"Talk","Files":"WAC_Sustainability 2019.pdf (282617 bytes)","Pages":"113"},{"Media":"https://youtu.be/uaD5vK4y9ps","Paper ID":"51","Paper Title":"Essentia in the browser","Abstract":"ABSTRACTWeb technologies are evolving every day providing higher capabilities and enabling all kinds of software. We believe that audio signal processing and other MIR related tasks should not be an exception, and there is a clear interest and need of such web tools in this community. Ideally, these tools should be developed to be as powerful as the ones already available on other languages such as C/C++ and Python. This motivation drove our exploration on how to use Essentia [2], an open source C++ library for music and audio analysis, description and synthesis developed by the Music Technology Group of the Universitat Pompeu Fabra, in the web client as a JavaScript library using Emscripten [6] and WebAssembly [3].The biggest strength we see in using the same code both in the browser and in native applications is the robustness of our development process. This way all our data and efforts can be put into improving the algorithm available in Essentia instead of having to maintain two implementations in two different programming languages.In this talk, we will present the steps to follow to use Essentia in the client, as well as some use cases. We will also discuss difficulties we encountered during the implementation, such as problems compiling Essentia for Emscripten. Furthermore, we will analyze some decisions we took along the way and other questions that are still open.","Author Names":"Luis Joglar-Ongay (SonoSuite)*; Albin Correya (Music Technology Group, Universitat Pompeu Fabra); Pablo Alonso-Jiménez (Universitat Pompeu Fabra); Xavier Serra (Universitat Pompeu Fabra); Dmitry Bogdanov (Universitat Pompeu Fabra)","Track Name":"Talk","Files":"Essentia_in_the_Browser.pdf (104149 bytes)","Pages":"114--115"},{"Media":"https://youtu.be/jIj-tNYdoCM","Paper ID":"57","Paper Title":"Comparing apples to oranges: A comparison of AudioWorklet polyfills","Abstract":"The specification of the Web Audio API is nearing the V1 milestone but there is still only one implementation of the AudioWorklet so far in Chromium based browsers. Firefox is expected to catch up soon but there is uncertainty whether or not the AudioWorklet will be implemented in Safari. For a foreseeable future Web Audio developers can't rely on the AudioWorklet to be available in all browsers.But as many other new browser technologies the AudioWorklet can be used in browsers which do not support it natively by utilizing a polyfill as fallback strategy. Three polyfills are currently available which do all provide the same API as the native implementation but do of course have other performance characteristics. Every polyfill follows a slightly different approach.This talk will incorporate a comparison of the native AudioWorklet and all available polyfills. They do for example differ in the way in which they emulate the AudioWorkletGlobalScope. One uses a Web Worker, the other uses an iframe and the third one is evaluating the AudioWorklet code on the main thread. This has not only implications on the performance but can also be a security risk when running third party AudioWorklets from untrusted sources. On the other hand executing the code on the main thread will save some time because it avoids passing around costly messages. In some scenarios it might be possible to achieve a lower latency using that technique. But this assumption falls short in case the main thread is very busy and can't invoke the process() function in a timely manner. In such a situation it is better to offload the work to an iframe or a Web Worker to execute the code in parallel.As with many other decisions choosing the right AudioWorklet polyfill is a decision depending on many factors. This talk will provide an opinionated checklist which is supposed to help to choose the most appropriate polyfill for any use case.","Author Names":"Christoph Guttandin (Media Codings)*","Track Name":"Talk","Files":"proposal.pdf (53412 bytes)","Pages":"116"},{"Media":"https://youtu.be/vxz0mjFCsqs","Paper ID":"62","Paper Title":"Opening the Dragon's Den: Interactive Welcome to Baton Rouge Entrepreneurship Week","Abstract":"An interactive system was developed to invite participants to the Baton Rouge Entrepreneurship Week opening event. The system consisted of a reactive entryway with an imposing projection on a curved wall, a video tracking and projection system covering the floor of the space, an array of iPad stations throughout the area, and participants using their cellphones to participate in the event. Through these cell phones, web audio was used to create a uniquely personal connection with sound effects and spoken phrases that could not be achieved by the shared public display alone.This talk will cover the technical aspects of the installation including the novelty of pairing video tracking with distributed performance systems to allow for the identification of individual participants and enable targeting them with interactions both on their mobile device and in the public space beyond.","Author Names":"Jesse Allison (Louisiana State University)*; Derick Ostrenko (Louisiana State University)","Track Name":"Talk","Files":"BREW_WAC_2019.pdf (3742486 bytes)","Pages":"117--118"},{"Media":"https://youtu.be/py6wQ07YyCE","Paper ID":"65","Paper Title":"Connecting Web Audio to Cyber-Hacked Instruments in Performance","Abstract":"Artists and composers of distributed and networked music tend towards mobile devices that contain web browsers (smartphones, tablets, and laptops) as their primary mechanism for creating interactive sonic works.  This integrates well with technologies explored at this conference such as web audio, web sockets, web midi, device sensors and click/touch interactions in conjunction with the computational devices themselves.  As audiences are increasingly exposed to distributed  & networked musical performances(D/NMP) presented through their personal, do-it-all devices, the opportunity arises to move beyond this novelty and expand the palette of networked devices while retaining musical comprehensibility. To expand the pool of possible hardware devices capable of controlling, reacting to, generating sound and processing sound in collaboration with web audio-based applications, we present artistic endeavors in creating and composing with the recent frameworks Bendit_I/O and NexusHUB. Together they allow nearly any commercially-available electronic device to be cyber-hacked and performed collaboratively along with web audio applications in typical D/NMP settings.  Interrogation of select historical precedents and an explanation of the Bendit_I/O and NexusHUB frameworks, precede discussion of the “gravity|density” performance showcasing the potential for expanding the pool of web audio art into the realm of re-purposed technology and the Orchestra of Things(OOT/IoMusT).","Author Names":"Anthony Marasco (Louisiana State University)*; Jesse Allison (Louisiana State University)","Track Name":"Talk","Files":"WAC_2019_PAPER_CR.pdf (862420 bytes)","Pages":"119--122"},{"Media":"https://youtu.be/fsHEpF1P9A8","Paper ID":"69","Paper Title":"Flexible visualization of sound collections","Abstract":"This submission proposes a talk on content-based visualization of sound collections. Previous works have covered visualization of sounds using content-based descriptors, and visualization of collections using dimensionality reduction algorithms. Combining both provides a flexible framework for devising novel web audio interfaces.","Author Names":"Gerard Roma (University of Huddersfield)*","Track Name":"Talk","Files":"fvsc.pdf (606900 bytes)","Pages":"123--124"},{"Media":"","Paper ID":"","Paper Title":"","Abstract":"","Author Names":"","Track Name":"","Files":"","Pages":""}]