[{"Media":"","Paper ID":"5","Paper Title":"Generative.fm","Abstract":"Generative.fm is an open-source platform for playing generative music in the browser that features a collection of browser-based generative music systems. The Web Audio API is an essential component of this project.","Author Names":"Alex Bainter (Alex Bainter)*","Track Name":"Artwork","Files":"AlexBainterGenerativefmWAC.pdf (334406 bytes)","Pages":""},{"Media":"","Paper ID":"9","Paper Title":"Permutable","Abstract":"In this paper, I describe the interactive musical artwork Permutable. This artwork was created with the algorithmic software system Tweakable by the same author.Permutable aims to bring parametric musical composition approach to the public, enabling users to create sections of a composition by changing the parameters of a pre-defined structure.","Author Names":"Julian Woodward (Visual Systems Ltd)*","Track Name":"Artwork","Files":"WAC - permutable - rev2.pdf (609936 bytes)","Pages":""},{"Media":"","Paper ID":"34","Paper Title":"Ballot Box Concerto","Abstract":"The 2019 Indonesian election was the biggest single-day election in the world, with an electorate of 190 million people voting for 5 different levels of government over the course of 9 hours. It was the first time the country voted for parliament and president at the same time.This composition takes the turnout as a data source and visualises this mammoth event in sound, using the presidential vote data mapped across the country as the input which determines the synth parameters written in Web Audio API. The votes will be simulated over the course of the piece, which each individual vote contributing to the soundscape that is created.There will be user interaction in that the piece will turn each region into a distinct sound source, meaning that the map can be explored, with different sounds reflecting the different outcomes across the country, as well as accounting for the time zone difference - as each region was open for a maximum of six hours, creating offsets as different time zones ballot boxes opened and closed.The technical implementation of this piece builds on the work I did in my post-graduate research, which took real-time data feeds from video games and used them as inputs to a custom synthesiser that created music based on the numerical input. The composer takes a more formative role, picking the textures that the numbers might create, rather than being able to control the detail.Despite it being a fixed set of numbers, there are technical challenges of trying to work with 130 million individual data points in the browser, so part of the exploration in this piece will be how to handle this amount of data creatively and practically - as possible solutions I will be looking into storing the simulation results server-side and sending them to the user or using Web Assembly.Prototype link: https://observablehq.com/d/07597b321f42b84c","Author Names":"Josh Rayman (n/a)*","Track Name":"Artwork","Files":"","Pages":""},{"Media":"","Paper ID":"45","Paper Title":"Wireplex, an Extended Flow of Data as Distributed Sound Sculpture","Abstract":"This article presents a networked sound sculpture made using web technologies. The intervention described explores the generation of content in large numbers of distributed interfaces with potentially large distances across the globe. Using Akson audio-visual (AV) environment, a distributed connection is maintained to all machines that remain publicly linked. We explore and present Wireplex as an artistic use of the Internet creating an irregular platform to reproduce the artwork.","Author Names":"Luis Arandas (Braga Media Arts)*; José Gomes (Portuguese Catholic University CITAR School of Arts: Braga Media Arts); Rui Penha ()","Track Name":"Artwork","Files":"wire.pdf (1364119 bytes)","Pages":""},{"Media":"","Paper ID":"50","Paper Title":"Acoustic Atlas","Abstract":"Acoustic Atlas aims to digitally preserve the acoustics and soundscapes natural and cultural world heritage sites.  Enabled by web-audio, it is a new but growing platform created by liaising with acoustic teams worldwide to gather and share data on existing acoustic surveys as well as to conduct research on different methodologies of acoustic research in the context of world heritage conservation. The project’s innovative approach will make the acoustical heritage of endangered heritage sites widely accessible. It will bring environmental, educational, conservation and artistic benefits by promoting and enriching heritage research and connecting international researchers and sound artists in the field of heritage acoustics. The online web-audio platform enables Acoustic Atlas to run on most computers or mobile devices and utilizes the built-in microphone and headphone output of a device to transport a visitor to the selected heritage site via headphones and live microphone feed. Any participant can thus interact with the acoustic simulation (termed auralisation) of each site from the first-person point of hearing. The listener can talk, sing, clap or project any sound in real-time, into a simulation to hear the reverberations, resonances, and echoes of each site and thus experience it in a direct sensory way. An immersive soundscape, that morphs between the acoustics of various sites, including cathedrals and caves will be presented as a listening experience.The final presentation of Acoustic Atlas will be available on 29 November 2019 here: https://acousticatlas.de","Author Names":"Cobi van Tonder (Acoustic Atlas)*; Guergana  Tzatchkova (Acoustic Atlas)","Track Name":"Artwork","Files":"WAC ACOUSTIC ATLAS2.pdf (154185 bytes)","Pages":""},{"Media":"","Paper ID":"72","Paper Title":"Cereris","Abstract":"(IMPORTANT) Online Simulation: https://codepen.io/filippoguida/pen/547cb3dea1b819d2116b7ee37c33c4dd?editors=1111(IMPORTANT) Video Extract: https://www.dropbox.com/s/sxrvvf1w5680o3u/2019-06-30%2013-44-45.mov?dl=0__________________________________________________CererisFilippo Guida 2018Cereris is a location-based artwork developed using technologies for web and mobile development. The connection between sound and space represent a critical factor in the everyday listening experience. Understand the relation between ourselves and the environment through a primal study of the acoustic elements we perceive. Therefore, replace the environmental sounds with artificial sound sources over noise canceling headphones represent a way to drive that process: set the relation between listener and environment by designing an acoustic world to explore. In this respect, the work itself may be considered as a sort of \"sound sculpture.\" The acoustic outcome is based on the actual location of the listener so that the sound change throughout space and provide a different result wherever on the planet. Cereris is an artwork that celebrates the vastity of the world we live in. In this hyper-connected reality we build for ourselves no place seems too far, while the truth is that they are and we will not be able to see most of them. Rediscover our real relationship with the environment through sound exploration.","Author Names":"Filippo Guida (none)*","Track Name":"Artwork","Files":"","Pages":""},{"Media":"","Paper ID":"","Paper Title":"","Abstract":"","Author Names":"","Track Name":"","Files":"","Pages":""}]