[{"Media":"https://youtu.be/6RO9K2wDREE","Paper ID":"3","Paper Title":"Generative Music in the Web Audio API","Abstract":"While there are many examples of interactive applications being built with the Web Audio API - from new and unique synthesis instruments, to emulators of popular signal processors, to audio engines for games - there are remarkably few that make use of the API's ability to implement systems which autonomously generate music. The work presented at the link below is a collection of six pieces in which all sounds are synthesized in real time: \n\nhttps://www.paulparoczai.net/#/webaudio/","Author Names":"Paul A Paroczai (Gold Saucer Studios)*","Author Emails":"paulparoczai@gmail.com","Primary Contact Author Email":"paulparoczai@gmail.com","Track Name":"Artwork","Files":"PAUL PAROCZAI - WAC 2021 - CAMERA READY.pdf (136994 bytes)","Pages":""},{"Media":"https://youtu.be/QWCVNIsQs_8","Paper ID":"14","Paper Title":"immaterial.cloud","Abstract":"immaterial.cloud is an immersive audiovisual installation that explores a possible networked future of peer-to-peer technologies, away from the cloud. Participants experience the work via two to four smartphones placed in different locations in a room. As participants walk up to a phone, they see a representation of themselves through data. If the participant gets close enough, the phone triggers a change in the sound of immaterial.cloud and the other phones follow.","Author Names":"Tate Carson (Louisiana State University)*","Author Emails":"tatecarson@gmail.com","Primary Contact Author Email":"tatecarson@gmail.com","Track Name":"Artwork","Files":"Carson_immaterial_cloud_CameraRead.pdf (1555026 bytes)","Pages":""},{"Media":"https://youtu.be/4h9FbDqTk4c","Paper ID":"16","Paper Title":"LudoTune","Abstract":"LudoTune is a browser-based musical toy that allows users to create music in a 3D environment by building cube-based structures. Users’ creations can range from simple loops, to strange musical sculptures, to entire songs involving hundreds of cubes.","Author Names":"Dylan Turner (Dylan Turner)*","Author Emails":"dylan@dylanturner.dev","Primary Contact Author Email":"dylan@dylanturner.dev","Track Name":"Artwork","Files":"WAC Submission - LudoTune (1).doc (287744 bytes)","Pages":""},{"Media":"https://youtu.be/f-wzynC2lMA","Paper ID":"29","Paper Title":"Radio-active Monstrosities","Abstract":"In this paper, I describe the artwork Radio-active Monstrosities, a web-audio interface that addresses ways of listening to collective voices and certain female-sounding voices that are perceived as inappropriate or annoying — because of the quality of their sound, their gender, the medium's distortions but also stereotypes and collective memories that they often awake. These are verbal expressions that have been associated with forms of 'monstrosity' since ancient times. Visitors of the page are invited to record themselves and choose a type of distortion to participate in, forming new imaginaries around technologically-mediated voices, which through their technical 'monstrosity', can reveal other forms of speech.","Author Names":"Angeliki Diakrousi (-)*","Author Emails":"diakaggel@gmail.com","Primary Contact Author Email":"diakaggel@gmail.com","Track Name":"Artwork","Files":"WAC_paper_radioactive.pdf (166567 bytes)","Pages":""}]