[{"Media":"https://youtu.be/bKL2nFy5XDk","Paper ID":"7","Paper Title":"Live voice transformations for web conferencing using the browser","Abstract":"This demo consists of two elements: the web technology for real-time vocoding and its application for live voice transformation in web conferencing. This is an interesting approach, now more than ever in times of COVID-19, for modifying your speech in virtual conferences. We present a software-based solution that should be available to anyone doing web conferencing.","Author Names":"Gerard Llorach (University of Oldenburg)*; Mattes Ohlenbusch (University of Oldenburg); Thomas Brand (University of Oldenburg)","Author Emails":"gerard.llorach.to@uni-oldenburg.de; mattes.ohlenbusch@uni-oldenburg.de; thomas.brand@uni-oldenburg.de","Primary Contact Author Email":"gerard.llorach.to@uni-oldenburg.de","Track Name":"Demo","Files":"WAC2021 LPC-Demo Paper.pdf (161562 bytes)","Pages":""},{"Media":"https://youtu.be/-rp7RW4mA8I","Paper ID":"41","Paper Title":"open.unmix.app - towards audio separation on the edge","Abstract":"Audio separation has recently become a mature technology, with state of the art reaching performance that permits wide audience application. While recent research continues to develop sophisticated methods to make results even better, we present our recent work in bringing the reference open-unmix model to the edge. This results in open.unmix.app, a web-based platform for audio separation. We demonstrate two contributions: First, we report on the difficulties of bringing a state-of-the-art deep learning-based model to javascript using TensorFlow.js including all necessary pre-and postprocessing. Solving them enables performing separation and enhancement of music and speech signals directly in the browser. Second, we present a platform that exploits this web-separation technology and allows users to share separated multitrack audio on the web using a custom, embeddable multi-track player.","Author Names":"Fabian-Robert Stöter (Inria, France)*; Maria Clara Machry Jacintho (Universidade Federal do Rio Grande do Sul); Delton de Andrade Vaz (Universidade Federal do Rio Grande do Sul); Stefan  Uhlich (Sony European Technology Center); Yuki Mitsufuji (Sony Group Corporation); Antoine Liutkus (Inria)","Author Emails":"mail@faroit.com; mcmachry@gmail.com; delton.vaz@gmail.com; stefan.uhlich@sony.com; Yuhki.Mitsufuji@sony.com; antoine.liutkus@inria.fr","Primary Contact Author Email":"mail@faroit.com","Track Name":"Demo","Files":"stoeter_wac.pdf (859333 bytes)","Pages":""}]