[{"Media":"https://www.youtube.com/watch?v=f0XO4A_-EeY","Paper ID":"68","Paper Title":"Interactive generative models for music","Abstract":"Anna Huang is a Research Scientist at Google Brain, working on the Magenta project. Her research focuses on designing generative models and tools to make music more interactive and approachable. She is the creator of Music Transformer, and also the ML model Coconet that powered Google’s first AI Doodle, the Bach Doodle, in 2 days harmonizing 55 million melodies from users around the world.  She holds a PhD in computer science from Harvard University and was a recipient of the NSF Graduate Research Fellowship. She spent the later parts of her PhD as a visiting research student at the Montreal Institute of Learning Algorithms (MILA), where she also currently co-advises students. She publishes in machine learning, human-computer interaction, and music, at conferences such as ICLR, IUI, CHI, and ISMIR. She is currently an editor for the TISMIR journal’s Special issue on AI and Musical Creativity.  She was a judge for the first international AI Song Contest, and is organizing its second edition. As a composer, she wrote for a cappella, mixed ensembles and orchestra. She also wrote for tape and live electronics that was performed on the 40-channel HYDRA loudspeaker orchestra. She holds a master’s in media arts and sciences from the MIT Media Lab, and a dual bachelor’s degree in computer science and music composition from the University of Southern California. She grew up in Hong Kong, where she learned to play the guzheng.","Author Names":"Anna Huang","Track Name":"Keynote","Files":"","Pages":""},{"Media":"https://www.youtube.com/watch?v=7SWu3txbg-w","Paper ID":"69","Paper Title":"Grassrouters Music Performance","Abstract":"Anna Xambó is a Senior Lecturer in Music and Audio Technology at De Montfort University, a member of the Music, Technology and Innovation – Institute of Sonic Creativity (MTI2), and the principal investigator of the EPSRC HDI Network Plus funded project “MIRLCAuto: A Virtual Agent for Music Information Retrieval in Live Coding”. She specialised in human-computer interaction and music technology at Universitat Pompeu Fabra, and completed her PhD in music computing at The Open University.  Her passion for sound and music computing kept being nurtured as a postdoctoral fellow at Georgia Tech, a postdoctoral research assistant at Queen Mary University of London, and an Associate Professor in Music Technology at the Norwegian University of Science and Technology. Her research and practice focus on sound and music computing systems looking at novel approaches to collaborative, participatory, and live coding experiences.  Dr. Xambó has contributed to the Web Audio Conference as a programme committee member and author since 2016 and has served as music/artworks co-chair in 2016 and general co-chair in 2019.","Author Names":"Anna Xambó","Track Name":"Keynote","Files":"","Pages":""},{"Media":"https://www.youtube.com/watch?v=sdlB-On6Rfk","Paper ID":"70","Paper Title":"Accessibility and web audio technologies","Abstract":"Senior software engineer and Microsoft Accessibility MVP. I’ve been fighting and having fun with technology for over thirteen years. My goal? Making technology more accessible every day… and learning, always learning something new.  Specialized in .NET, I am passionate about developing and making applications that improve the daily lives of people like me, we have a different way of accessing information.  Proud husband and father of an adorable six-year-old boy. I love music (I’m a pianist but with the PC keys I don’t have much time left for that hobby), and a lover of literature.","Author Names":"Juanjo Montiel","Track Name":"Keynote","Files":"","Pages":""},{"Media":"","Paper ID":"","Paper Title":"","Abstract":"","Author Names":"","Track Name":"","Files":"","Pages":""},{"Media":"","Paper ID":"","Paper Title":"","Abstract":"","Author Names":"","Track Name":"","Files":"","Pages":""},{"Media":"","Paper ID":"","Paper Title":"","Abstract":"","Author Names":"","Track Name":"","Files":"","Pages":""},{"Media":"","Paper ID":"","Paper Title":"","Abstract":"","Author Names":"","Track Name":"","Files":"","Pages":""},{"Media":"","Paper ID":"","Paper Title":"","Abstract":"","Author Names":"","Track Name":"","Files":"","Pages":""}]