[{"":"","Paper ID":"27","Paper Title":"Performing with QuaverSeries Live Coding Environment","Abstract":"This performance will use QuaverSeries, a collaborative live coding environment. The three performers will collaborate on the website of QuaverSeries, writing programs to produce ambient techno music with its domain-specific language. The first two performers will perform at the conference scene in Trondheim, while the third performer will join the performance online in Oslo.","Author Names":"Qichao Lan (University of Oslo)*; Çağrı Erdem (University of Oslo); Alexander Refsum Jensenius (University of Oslo)","Track Name":"Performance","Files":"QuaverSeries_Performance_ready.pdf (534112 bytes)","Pages":"156--157","Media":"https://youtu.be/qnEiHg6ljTk"},{"":"","Paper ID":"41","Paper Title":"Three Pidgins: Live Coding Performance","Abstract":"We present Three Pidgins, a live coding musical performance as an example of the live coding systems created with Sema, our web audio-based technology. Using three bespoke mini-languages, Kiefer, Bernardo and Magnusson will collaborate on a co-located networked musical performance where music is live-coded in real time. Each of the languages serves as an instrument in the ensemble of three.","Author Names":"Francisco Bernardo (University of Sussex)*; Chris Kiefer (University of Sussex); Thor Magnusson (Music Department, University of Sussex)","Track Name":"Performance","Files":"WAC2019_3_Pidgins_Perform_FB_CK_TM.pdf (347774 bytes)","Pages":"158--159","Media":"https://youtu.be/DRxBCabqsqA"},{"":"","Paper ID":"53","Paper Title":"Cyclic Gibbering","Abstract":"This live coding performance uses Gibber, a browser-based environment for live coding. It is the first performance to feature a browser-based implementation of the TidalCycles mini-notation, enabling new rhythmic and sequencing possibilities in Gibber.","Author Names":"Charlie Roberts (Worcester Polytechnic Institute)*","Track Name":"Performance","Files":"cyclic_gibberings_wac_2019.pdf (237749 bytes)","Pages":"160","Media":"https://youtu.be/eLwkaOK0G38"},{"":"","Paper ID":"55","Paper Title":"Trondheim EMP Repository processing","Abstract":"The ensemble Trondheim Electroacoustic Music Performance (EMP) investigates new modes of communication in an ensemble when new technology is introduced as part of the ensemble repertoire. In the recent three years, the focus has been on crossadaptive processing as a musical intervention in the interplay. More info on the crossadaptive project can be seen at the project blog [3] and also the album Poke It With A Stick / Joining The Bots released in 2019. For more background on aspects of crossadaptive processing and performance, see [1, 2, 4, 5, 6]. For this performance we work with a web-based repository of sounds, explored via a live coding interface [7, 8]. This allows access to a massive archive of sounds from Freesound.org, and the selection of sounds is done via sound descriptors. The integration of this instrument in an ensemble setting is interesting, as traditional and nontraditional modes of musical interaction are activated in dialogue. Using web-based access to the repository allows a generality of instrument design, and this is combined with a strategic mode of performance in this instrument. With \"strategic\" we mean here, that most sounds are not performed directly by physical action, but cued up in patterns via live coding. These sounds are then live processed by other members of the ensemble, responding more directly with physical and gestural instrumental action on the signal coming from the web instrument. The signal is also live processed in a crossadaptive fashion, so that audio features extracted from other performers' actions will modulate the parameters of processing for the web audio instrument. The ensemble also utilize gesturally based interfaces from interactive dance, here used to control elements of audio synthesis and processing.","Author Names":"Øyvind Brandtsegg ()*; Anna Xambó (De Montfort University); Trond Engum (NTNU); Andreas Bergsland (); Carl Haakon Waadeland (NTNU)","Track Name":"Performance","Files":"WACp-2019.pdf (133005 bytes)","Pages":"161--162","Media":"https://youtu.be/eRWb1zLYL88"},{"":"","Paper ID":"59","Paper Title":"Responsive Space","Abstract":"The performance \"Open Form III\" is created with a frameworkcalled \"Responsive Space\". The framework allows a flexibleway of working with distributed sound and image projections.The system consists of a multichannel speaker-system, 2-3video projections a local Wifi network with a connectedwebserver and mobile devices. The audience is invited to loginto the local network with their mobile devices. In the browserof the mobile devices sound and image is generated orstreamed.As we experienced in previous projects with live audiostreamingand mobile devices the spatial gesture of music as amusical parameter comes to the fore. In the performances theaudio is streamed with an icecast-server. The visual output isgenerated with javascript in the client’s browser.Shortcomings, like the various time delay of the audio-streamof different mobile devices or the variation of spatial and visualoutput, lead to interesting artistic effects. The system offersgreat opportunities to experiment with different spaces and thespatialization of sound and image.","Author Names":"Raimund Vogtenhuber (University of Arts Zurich / ICST)*","Track Name":"Performance","Files":"Responsive Space – Performance_WAC.pdf (133466 bytes)","Pages":"163","Media":"https://youtu.be/Nq9-M36XMlU"},{"":"","Paper ID":"61","Paper Title":"gravity|density","Abstract":"\"gravity|density\" is a work for cyber-hacked devices and Web Audio applications. Our goal is to develop systems that merge repurposed and hacked pieces of hardware into the networked world of web art. While the electronic sophistication of mobile devices and the flexibility of web applications allow artists to create immerse audiovisual environments without the use of traditional music hardware, we believe that digital artists should not cast aside the tools of the past, but rather find new and creative ways of modifying them so that they can inform the ways in which we explore and create with new digital, web-based tools. Through these new hybrid systems, we can both embrace the limitations and push the boundaries of any hardware we use for the purpose of creating collaborative sonic environments.In gravity|density, we begin by manipulating fixed-audio sources through the performance of hacked CD players. The sonic results of this mangled audio is sampled and then distributed to the audience’s mobile devices in both passive and interactive manners. Passive distributions allow us to create intricately-spacialized rhythmic interplay between the glitching CD players and the blanket of overlapping samples dispersed throughout the networked audience. Active distributions allow the audience to join in our performance; by choosing small portions of the audio sent to them and send- ing these selected samples back to us, we string this audio together and feed it into a cyber-controlled distortion pedal before sending it back to the audience for more manipulation. This results in overlapping cycles of control and audio generation between performer, audience, network, and machine.","Author Names":"Anthony Marasco (Louisiana State University)*; Jesse Allison (Louisiana State University)","Track Name":"Performance","Files":"gravity_density_wac_camera_ready.pdf (804605 bytes)","Pages":"164--165","Media":"https://youtu.be/ZevQMrmeY3I"},{"":"","Paper ID":"70","Paper Title":"map mop","Abstract":"This submission proposes a music performance to be delivered by the author on a multi-touch tablet. The piece is based on a collection of sounds generated using various analog devices. The collection is presented as an interactive visualization. The interface is projected, so both the collection and the performer's actions are readable to the audience.","Author Names":"Gerard Roma (University of Huddersfield)*","Track Name":"Performance","Files":"mapmop.pdf (1012643 bytes)","Pages":"166","Media":"https://youtu.be/Cwm_njSp1IQ"},{"":"","Paper ID":"","Paper Title":"","Abstract":"","Author Names":"","Track Name":"","Files":"","Pages":"","Media":""}]