[{"Media":"https://youtu.be/Ep5J97MDt7A","Paper ID":"19","Paper Title":"Collaborative Live Coding with Glicol Music Programming Language","Abstract":"Glicol is a graph-oriented live coding language developed with Rust, WebAssembly and AudioWorklet. This language can run in its web-based IDE that supports collaborative coding. In this performance, we invite the participants from the Glicol workshop to join the performance virtually. Each performer will be given the opportunity to write at least one musical loop, and the first author will be in charge of when to execute the code. The music style will be improvised experimental/ambient techno.","Author Names":"Qichao Lan (University of Oslo)*; Alexander Refsum Jensenius (University of Oslo)","Author Emails":"qichao.lan@imv.uio.no; a.r.jensenius@imv.uio.no","Primary Contact Author Email":"qichao.lan@imv.uio.no","Track Name":"Performance","Files":"Glicol_Performance_WAC (4).pdf (806677 bytes)","Pages":""},{"Media":"https://youtu.be/ExO2QwGcADo","Paper ID":"23","Paper Title":"Noise Symphony","Abstract":"Noise symphony is part of a series of pieces created from a selection of 690 sound sample taken by the author from https://freesound.org database using http://playsound.space software, from a query using the word \"noise\", that retrieved around 37000 results. Sound were selected based on their timber morphology, following a criteria of apparent visual difference. In this piece, sounds will be played together with solo extended vocal techniques.","Author Names":"Ariane S Stolfi (Universidade Federal do Sul da Bahia)*","Author Emails":"arianestolfi@gmail.com","Primary Contact Author Email":"arianestolfi@gmail.com","Track Name":"Performance","Files":"Noise_Symphony_01_compressed.pdf (159009 bytes)","Pages":""},{"Media":"https://youtu.be/4eECelNQbB8","Paper ID":"28","Paper Title":"Floop Jam","Abstract":"This submission proposes a web-based collaborative performance using Floop, a loop jamming system based on the Freesound database. The performers meet in a virtual room with a collection of loops that have been matched for rhythm, and organized according to timbre similarity. Their exploration develops as a DJ session, which is visible to the audience through the projected interface.","Author Names":"Gerard Roma (University of Huddersfield)*; Frederic Font (Music Technology Group - Universitat Pompeu Fabra); Antonio Ramires (Universitat Pompeu Fabra)","Author Emails":"g.roma@leedstrinity.ac.uk; frederic.font@upf.edu; antonio.ramires@upf.edu","Primary Contact Author Email":"g.roma@leedstrinity.ac.uk","Track Name":"Performance","Files":"floop_jam_compressed.pdf (320362 bytes)","Pages":""},{"Media":"https://youtu.be/uFeWnyEX6E4","Paper ID":"33","Paper Title":"Live Coding with Crowdsourced Sounds and A Virtual Agent Companion","Abstract":"This performance combines machine learning algorithms with music information retrieval techniques to retrieve crowdsourced sounds from the online database Freesound.org, which results in a sound-based music style. The use of a virtual companion complements a human live coder in her/his practice. The core themes of legibility, agency and negotiability in performance are researched through the collaboration between the human live coder, the virtual agent and the audience.","Author Names":"Anna Xambó (De Montfort University)*","Author Emails":"anna.xambo@dmu.ac.uk","Primary Contact Author Email":"anna.xambo@dmu.ac.uk","Track Name":"Performance","Files":"WACp_2021.pdf (449876 bytes)","Pages":""},{"Media":"https://youtu.be/zKyXkVGrFgA","Paper ID":"38","Paper Title":"AIrgots: Live Coding Performance","Abstract":"We present a hybrid live coding musical performance using the latest version of Sema, the live coding language design and performance playground for the Web, with a custom Web Audio API signal engine. We explore machine learning, bespoke languages and interfaces as creative material in musical performance. Bernardo, Kiefer and Magnusson will collaborate as an ensemble of three, with networked and synchronized instances of Sema, in a performance which combines elements of improvisation and machine agency.","Author Names":"Francisco Bernardo (University of Sussex)*; Chris Kiefer (University of Sussex); Thor Magnusson (Music Department, University of Sussex)","Author Emails":"f.bernardo@sussex.ac.uk; c.kiefer@sussex.ac.uk; t.magnusson@sussex.ac.uk","Primary Contact Author Email":"f.bernardo@sussex.ac.uk","Track Name":"Performance","Files":"WAC2021-AIrgots-camera-ready.pdf (1315180 bytes)","Pages":""},{"Media":"https://youtu.be/rB3-MS41KRU","Paper ID":"46","Paper Title":"Aerial Glass: A Live Browser and Aerial Silk Performance","Abstract":"Aerial Glass is a real-time performance, delivered through a website, of aerial silk acrobatics composited with a live browser performance of various video clips and audio composition. It uses the NexusHub framework to distribute a live in-browser performance of pre-rendered, transparent video clips, audio files, and web audio effects to everyone else visiting the website. A live physical performance on aerial silks is recorded in front of a green screen and live streamed to the website to be composited with the browser performance. \n\nWe propose a live performance of the work during the Web Audio Conference with performers at LSU, distributed to a worldwide audience through a website.","Author Names":"Jesse Allison (Louisiana State University)*; Austin Franklin (LSU); Nicholas Erickson (LSU)","Author Emails":"jtallison@lsu.edu; afran84@lsu.edu; nickwe@lsu.edu","Primary Contact Author Email":"jtallison@lsu.edu","Track Name":"Performance","Files":"","Pages":""},{"Media":"https://youtu.be/aE15m5Q4LMI","Paper ID":"53","Paper Title":"SHP of Theseus","Abstract":"SHP of THSEUS is a collaborative audiovisual composition that draws inspiration from the Greek myth of Theseus. Over time, Theseus’ ship was gradually renewed as every piece of original wood rotted and required replacement. We navigate this philosophical quandary of identity through collective control of performance setups in combination with an open score that affords individual interpretation. The score is generated randomly from a series of 10 im- ages. These images are categorized as either ‘Sound’ or ‘Control’ instructions and presented sequentially to each performer. A ‘Sound’ image is interpreted through sonic gesture, while ‘Control’ images prompt each performer to send control data to other performers, intervening in the local control of the remote performance setups. As instruments are altered over time, each performer relinquishes some aspects of control over their own performance as they continue to steer forward with their individual interpretation of the score. SHP of THSEUS is realized using a Node.js-based collaborative tool called Collab-Hub, a client-server platform that allows any number of performers to transmit control data to each other over the internet. Performers can connect via chosen software or hardware platform (e.g. circuit- bent devices using Bendit_I/O). Collab-Hub was developed at the beginning of the ongoing pandemic and has facilitated semi-weekly improvised live-stream performances, collaborative instrument design, and new performances and re-search realized by other composers and ensembles, including \"Rhumb-Line\" and the Networked Performance project at the Advanced Computing Center for The Arts and Design at Ohio State University. Additionally, the version of SHP of THSEUS being presented allows for audience interaction through a web-based Collab-Hub interface and locally-generated sound using web audio libraries.","Author Names":"Anthony T Marasco (University of Texas Rio Grande Valley)*; Nick Hwang (University of Wisconsin-Whitewater); Eric Sheffield (Miami University)","Author Emails":"anthony.marasco@utrgv.edu; hwangn@uww.edu; sheffie@miamioh.edu","Primary Contact Author Email":"anthony.marasco@utrgv.edu","Track Name":"Performance","Files":"WAC_2021_SHP-Performance-FINAL.pdf (1081921 bytes)","Pages":""},{"Media":"","Paper ID":"","Paper Title":"","Abstract":"","Author Names":"","Author Emails":"","Primary Contact Author Email":"","Track Name":"","Files":"","Pages":""},{"Media":"","Paper ID":"","Paper Title":"","Abstract":"","Author Names":"","Author Emails":"","Primary Contact Author Email":"","Track Name":"","Files":"","Pages":""},{"Media":"","Paper ID":"","Paper Title":"","Abstract":"","Author Names":"","Author Emails":"","Primary Contact Author Email":"","Track Name":"","Files":"","Pages":""}]