[{"Media":"","Paper ID":"18","Paper Title":"Ongaq JS: An elementary library for programming music","Abstract":"In this paper, I describe concepts and usages of Ongaq JS, a new elementary JavaScript library for programming music. This library makes it possible for many people, especially  beginners  or young students, to program music using various sound resources.","Author Names":"Hiroyuki Takakura (CodeNinth)*","Track Name":"Poster","Files":"ongaqjs-camera-ready-04.pdf (299856 bytes)","Pages":"126--127"},{"Media":"","Paper ID":"31","Paper Title":"A 2 Million Commercial Song Interactive Navigator","Abstract":"In this paper, we present a web-based interactive tool for exploring a collection of two million commercially released songs. It gathers song information from a large number of heterogeneous sources, web-based and audio-based, and integrates work from multiple research groups. The resulting tool can be used to request information about a specific song such as lyrics, metadata and chords; to navigate further on to linked external resources such as Discogs, AllMusic, MusicBrainz or a number of streaming providers; or to browse the collection by artist’s discographies or band membership. Several Web Audio applications are integrated and use the dataset to enrich the experience.","Author Names":"Michel Buffa (Université Côte d’Azur, CNRS, INRIA)*; Johan Pauwels (Queen Mary University of London); Jerome Lebrun (CNRS); Guillaume Pelerin (IRCAM)","Track Name":"Poster","Files":"WAC2019__Wasabi_demo_poster_wasabi_project.pdf (2733833 bytes)","Pages":"128--131"},{"Media":"","Paper ID":"56","Paper Title":"Cooperation experiments in web-based audiovisual works","Abstract":"Network possibilities are inherently ready for real-time cooperation among the users of the same website, in order to participate in running a multimedia installation, webaudio instrument, or audio-game. In this paper I summarize my works in this field, starting from web-only projects (Webcards, Forgattató, WebSynth), finishing at communication between locative installations and the web (Ring the Web!). Most of them are radically cooperative, which means that they aren't running stand-alone or even off-line because of their multi-user approach. With this initiative I argue that networked audiovisual artworks and instruments realize a communicative way of performing.","Author Names":"Balázs Kovács (University of Pécs)*","Track Name":"Poster","Files":"kbalazs-cooperative_web-poster.pdf (1024229 bytes)","Pages":"132--135"},{"Media":"","Paper ID":"","Paper Title":"","Abstract":"","Author Names":"","Track Name":"","Files":"","Pages":""}]