[{"Media":"https://youtu.be/9fHNwg5QCmI","Paper ID":"42","Paper Title":"Designing and Performing with Live Coding Languages for Signal Processing and Machine Intelligence on the Web","Abstract":"This workshop will give participants the opportunity to learn how to design their own live coding mini-languages and perform with them. Participants will get familiar with Sema, our live coding language design system, a user-friendly, web-based toolkit that provides an accessible entry point to signal processing, machine learning and machine listening. Participants will engage hands-on with our system and learn how these techniques can be used in the exciting domain of live coding musical performance. Additionally, the workshop will include a reflection and group discussion about participants’ experience with the system and techniques, new features and improvements.","Author Names":"Francisco Bernardo (University of Sussex)*; Chris Kiefer (University of Sussex); Thor Magnusson (Music Department, University of Sussex)","Track Name":"Workshop","Files":"WAC2019Workshop_FB_CK_TM_camera-ready.pdf (258390 bytes)","Pages":"174--175"},{"Media":"https://youtu.be/XNiSgrSjHIc","Paper ID":"75","Paper Title":"Live coding with Makkeróni - workshop","Abstract":"Makkeróni is a web-based live coding system which simulates a linux shell. The user operates with commands known from the BASH (ls, help, cat etc.), and also there are some audio-specific commands (play, freq, tone etc.). In this workshop we're going to learn how to use it, while possibly focusing on efficiency (pipes, joker characters, command history tricks) and network cooperation. If the participants are open for it, we could discuss the targets of further development as well.It's recommended for both new and experienced Linux shell users.Optimal length: 45-70minLink to the application: http://makker.hu/makkeroni/","Author Names":"Balázs Kovács (University of Pécs)*","Track Name":"Workshop","Files":"makkeroni-workshop-ext_abstract.pdf (262809 bytes)","Pages":"176--177"},{"Media":"https://youtu.be/x3npwjDvM4I","Paper ID":"78","Paper Title":"Web Audio API vs. native, closing the gap, take 2","Abstract":"The situation has evolved quite a lot, with the addition of various features,not necessarily related to audio, in the last few years.Shared memory, atomics, SIMD, Audio Worklets, WASM, Web MIDI are some of the features that allow building programs that were impossible to write a few yearsago.This workshop will take a bottom up approach to writing high-performanceapplications with the Web Audio API, with a definitive focus towards writingreal-time audio code in the context of a web application.In doing this, the reasoning will follow a bottom-up approach: understanding theproperties needed for a specific system, and try to them map web platformconstructs, with a definitive focus on high-performance and white-box analysis.Links to implementations themselves and the primitives chosen will have animpact on the final quality of the result, in terms of rendering speed, memoryfootprint, robustness, and extensibility.","Author Names":"Paul Adenot (Mozilla)*","Track Name":"Workshop","Files":"workshop.pdf (106615 bytes)","Pages":"178--179"},{"Media":"https://youtu.be/YllaTUGGnHE","Paper ID":"79","Paper Title":"Diversity Workshop","Abstract":"Two Norwegian organizations working with equality and diversity in technology and the arts sector cooperate with this workshop on diversity. We will present our experiences and work as well as offer some tools to stimulate and achieve diversity in the workplace and in communities such as Web Audio. The workshop will thus have two modules; (1) one first module by The Art of Balance and (2) one second module by Girls Geek Dinner. The workshops will be held in English. Previous knowledge of diversity and other equality concepts will not be necessary.","Author Names":"Miranda Moen (nn)*; Andrea Hegdahl Tiltnes (NTNU)","Track Name":"Workshop","Files":"WAC Paper template - Diversity workshop-final.pdf (205978 bytes)","Pages":"180--181"},{"Media":"https://youtu.be/EAGNVtU9oHc","Paper ID":"80","Paper Title":"Audiovisual Programming in Live Performance","Abstract":"In this workshop, participants will explore a variety of live coding technologies (including Gibber, Hydra, and the Force, among others) and discuss different approaches to multimodal programming / audiovisual synchronization with web technologies.","Author Names":"Charlie Roberts (Worcester Polytechnic Institute)*","Track Name":"Workshop","Files":"audiovisual_workshop_wac_2019.pdf (121381 bytes)","Pages":"182"},{"Media":"","Paper ID":"","Paper Title":"","Abstract":"","Author Names":"","Track Name":"","Files":"","Pages":""}]